/** 
 * ⚠️ Function Name Must be totalFine()
 * 
ট্রেনের একজন TT হিসেবে কাজ করছেন রবিন। প্রতিদিন অসংখ্য যাত্রী টিকিট হারিয়ে ফেলেন কিংবা কাটেন ই না। টিকিটবিহীন যাত্রীদের জরিমানা করতে গিয়ে প্রতিবার ক্যালকুলেশন করতে অনেক সময় লাগে। তাই TT রবিন চায়,এমন একটি ফাংশন যেখানে যাত্রীর ট্রেন ভাড়া দিলেই জরিমানার নির্ভুল হিসাব চলে আসবে। 
তুমি যেহেতু প্রোগ্রামার,তাই তোমাকে রবিন সাহেবের জন্য  totalFine নামে একটা function তৈরী করে দিতে হবে।  যেটা fare কে ইনপুট হিসেবে নেবে।  এবং fine ক্যালকুলেট করে return করবে। 
  
🧮 জরিমানা নির্ধারণের নিয়ম:

মোট জরিমানা = টিকিটের মূল ভাড়া + (২০% সারচার্জ) + অতিরিক্ত ৩০ টাকা সার্ভিস চার্জ

 */

function totalFine(fare) {
  if (fare <= 0 || typeof fare !== "number") {
    return "Invalid";
  }
  fine = fare + fare * (20 / 100) + 30;
  return fine;
}

console.log(totalFine(0));
